# list = ["短视频", "少妇", "萝莉", "女神", "巨乳", "美乳", "滴蜡", "虐待", "后入", "第一视角", "镜头特写", "国产", "剧情", "馒头逼", "动漫",
#         "3d", "少女", "母狗", "足交", "爆菊", "门事件", "学姐", "人妻", "自慰", "学妹", "诱惑", "91", "swag", "多p", "喷水", "乱伦", "av",
#         "口爆", "中文字幕", "轮奸", "爆乳", "3p", "4p", "内射", "颜射", "道具", "捆绑", "调教", "无码", "欧美", "动画", "姐姐", "妹妹", "18岁",
#         "女友", "SM", "电击", "皮鞭", "护士", "制服", "黑丝", "约炮", "偷拍", "日本90年代经典AV", "ktv", "妹妹", "妹妹", "按摩", "按摩", "按摩",
#         "人妻", "人妻", "女上位", "asmr", "中文同音", "口交", "gif", "大长退", "粉嫩", "女仆", "清纯", "贫乳", "特别版", "jk", "粉穴", "校花", "娇喘",
#         "闺蜜", "18", "丝袜", "空姐", "古装", "唯美", "纹身", "00后", "百合", "淫荡", "浴室", "车震", "反差表", "反差婊", "白虎", "模特", "情人", "麻豆",
#         "美臀", "野外", "老师", "娇小", "自虐", "爆操", "韩国", "高铁", "可爱", "双飞", "童颜", "手交"]
# dic = []
# id = 1
#
# for tag in list:
#     dic.append({
#         id: tag
#     })
#     print("insert into tags(id,tags) values(", id, ",'%", tag, "%');")
#     id = id + 1
#     # print(tag)
# # print(dic)



# 缺省参数
def namelist(name, gender=True):
    gender_text = "男生"
    if not gender:
        gender_text = "女生"

    print("%s是%s" % (name, gender_text))


# 多值参数
def demo(num, *args, **kwargs):
    print(num)
    print(args)
    print(kwargs)


def sum_num(*args):
    num = 0
    for i in args:
        num += i
    print("%d" % num)


namelist("xm")
sum_num(1, 2, 3, 4)


